#!/usr/bin/env python3
# -*- coding: utf-8 -*-

# Задание 2
# Дана строка. Удалить из нее все пробелы.

if __name__ == '__main__':

    s = input("Enter the word: ")
    s.replace(" ", "")
    print(s)
